results/pro6000_l40s_h100_h200_11_2025/l40s-other/l40s_x_2_QuantTrio_Qwen3-Coder-30B-A3B-Instruct-AWQ_vllm_benchmark.txt
============ Serving Benchmark Result ============
Successful requests:                     1200      
Maximum request concurrency:             400       
Benchmark duration (s):                  380.83    
Total input tokens:                      1196622   
Total generated tokens:                  1200000   
Request throughput (req/s):              3.15      
Output token throughput (tok/s):         3151.00   
Peak output token throughput (tok/s):    6203.00   
Peak concurrent requests:                420.00    
Total Token throughput (tok/s):          6293.14   
---------------Time to First Token----------------
Mean TTFT (ms):                          13937.09  
Median TTFT (ms):                        10996.72  
P99 TTFT (ms):                           73123.92  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          101.70    
Median TPOT (ms):                        101.57    
P99 TPOT (ms):                           170.75    
---------------Inter-token Latency----------------
Mean ITL (ms):                           101.59    
Median ITL (ms):                         72.30     
P99 ITL (ms):                            393.34    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          115531.42 
Median E2EL (ms):                        118228.30 
P99 E2EL (ms):                           184794.13 
==================================================

============ Docker Compose Configuration ============
services:
  vllm_0:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_container_0
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              device_ids: ['0']
              capabilities: [gpu]
    volumes:
      - /hf_models:/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
    ports:
      - "8000:8000"
    shm_size: '16gb'
    ipc: host
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.9
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 1
      --pipeline-parallel-size 1
      --model /hf_models/QuantTrio/Qwen3-Coder-30B-A3B-Instruct-AWQ
      --served-model-name QuantTrio/Qwen3-Coder-30B-A3B-Instruct-AWQ
      --max-model-len 8192
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health && curl -f http://localhost:8000/v1/models | grep -q 'object.*list'"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 600s

  vllm_1:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_container_1
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              device_ids: ['1']
              capabilities: [gpu]
    volumes:
      - /hf_models:/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
    ports:
      - "8001:8000"
    shm_size: '16gb'
    ipc: host
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.9
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 1
      --pipeline-parallel-size 1
      --model /hf_models/QuantTrio/Qwen3-Coder-30B-A3B-Instruct-AWQ
      --served-model-name QuantTrio/Qwen3-Coder-30B-A3B-Instruct-AWQ
      --max-model-len 8192
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health && curl -f http://localhost:8000/v1/models | grep -q 'object.*list'"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 600s

  nginx:
    image: nginx:alpine
    container_name: nginx_lb
    ports:
      - "8080:8080"
    volumes:
      - /home/riftuser/server-benchmark/nginx.vllm.conf:/etc/nginx/nginx.conf:ro
    depends_on:
      - vllm_0
      - vllm_1

  benchmark:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_client
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              count: all
              capabilities: [gpu]
    volumes:
      - /hf_models:/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
      - CUDA_VISIBLE_DEVICES=""
    entrypoint: ["/bin/bash", "-c"]
    command: ["sleep infinity"]
    profiles:
      - tools

============ Benchmark Command ============
vllm bench serve     --model QuantTrio/Qwen3-Coder-30B-A3B-Instruct-AWQ     --dataset-name random     --random-input-len 1000     --random-output-len 1000     --max-concurrency 400     --num-prompts 1200     --ignore-eos     --backend openai-chat     --endpoint /v1/chat/completions     --percentile-metrics ttft,tpot,itl,e2el     --base-url http://nginx_lb:8080
==================================================